list=[['数据分析',58,56],['Web开发',52,49],['自动脚本',43, 35 ],['机器学习',38, 31 ],['爬虫\网页解析',37,32],['软件测试',32, 26 ],['教学目的',28,28],['软件原型',27, 22 ]]
print('') # 输出一个空行
print('##################################### 你用Python做什么？ ######################################')
print('  1    \033[1;35;42m   \033[0m ') # 输出图注
print('  2    \033[1;31;42m   \033[0m  ')  # 输出图注
print('')
for item in list:  # 遍历列表
    print((58 - int(item[1])) * ' ' + '\033[1;32;42m ' + (int(item[1])) * ' ', '\033[0m  ' + str(item[2]) + '%' + '  ' + item[0])  # 输出2018年的应用方向占比
    print('')
print('##################################### 你用Python做什么？ ######################################')

print('2018   \033[1;31;42m   \033[0m    2017   \033[1;32;43m   \033[0m ')  # 输出图注
print('')
for item in  list:  # 遍历列表
    print((58 - int(item[1])) * ' ' + '\033[1;31;42m' + int(item[1]) * ' ', '\033[0;m ' + str(item[1]) + '%' + '  ' + item[0])  # 输出2018年的应用方向占比
    print((58 - int(item[2])) * ' ' + '\033[1;32;43m' + int(item[2]) * ' ', '\033[0;m ' + str(item[2]) + '%') # 输出2017年的应用方向占比
    print('') # 输出一个空行
